# Parse Satellite Data

In [41]:
from pathlib import Path
import pandas as pd

def load_lst_folder_with_datetime(
    folder_path,
    column_names,
    target_columns,
    datetime_cols=("year", "month", "day", "hour", "minute", "second"),
    file_extension=".lst",
    skiprows=0,
    fill_value=1.0e35,
    datetime_col_name="datetime"
):
    folder_path = Path(folder_path)
    files = sorted(folder_path.glob(f"*{file_extension}"))

    if not files:
        raise FileNotFoundError(f"No {file_extension} files found in {folder_path}")

    dfs = []
    for file in files:
        df = pd.read_csv(
            file,
            sep='\s+',
            names=column_names,
            header=None,
            skiprows=skiprows
        )
        df["year"] = 1900 + df["year"]  # Adjust year if needed
        # Construct UTC datetime
        df["datetime"] = pd.to_datetime(
            df[list(datetime_cols)],
            errors="coerce",
            utc=True
        )
        df[datetime_col_name] = df[datetime_col_name].dt.tz_localize(None)
        df.drop(columns=list(datetime_cols), inplace=True)
        dfs.append(df)

    full_df = pd.concat(dfs, ignore_index=True)
    # Replace fill values
    full_df.replace(fill_value, pd.NA, inplace=True)

    # Identify data columns (exclude datetime + source_file if present)
    data_cols = [
        c for c in full_df.columns
        if c not in {"datetime", "source_file"}
    ]

    # Drop rows where ALL data columns are NA
    full_df = full_df.dropna(
        subset=data_cols,
        how="all"
    )
    full_df.dropna(subset=target_columns, how="all", inplace=True)

    # Convert remaining columns to numeric
    for col in column_names:
        if col not in datetime_cols:
            full_df[col] = pd.to_numeric(full_df[col], errors="coerce")

    return full_df.reset_index(drop=True)

<>:24: SyntaxWarning: invalid escape sequence '\s'
<>:24: SyntaxWarning: invalid escape sequence '\s'
/var/folders/pf/x6mn9jt96z14ybg9rxsvmb100000gn/T/ipykernel_73026/1167788266.py:24: SyntaxWarning: invalid escape sequence '\s'
  sep='\s+',

## AE-C

In [42]:
ae_c = load_lst_folder_with_datetime(
    folder_path="/Users/elliotdable/Documents/PhD/research/fpi_ml/data/atmospheric_explorer/ae_c", 
    column_names=["year","month", "day","hour", "minute", "second", "altitude", "latitude", "longitude",
    "local_time", "local_magnetic_time",  "magnetic_inclination", "solar_zenith_angle", 
    "orbit_number", "mesa_wind_component", "neutral_temp", "vertical_winds"],
    target_columns=["neutral_temp", "vertical_winds", "mesa_wind_component"])

In [43]:
ae_c.sample(5)

,altitude,latitude,longitude,local_time,local_magnetic_time,magnetic_inclination,solar_zenith_angle,orbit_number,mesa_wind_component,neutral_temp,vertical_winds,datetime
72782,243.7,12.780,51.43,13.360,13.770,9.661,38.70,5118.0,NaN,945.8,NaN,1975-01-19 10:06:15
16418,283.0,35.130,-78.82,11.110,11.000,66.710,59.74,4657.0,NaN,799.5,NaN,1974-12-21 16:20:00
72394,252.2,-22.640,-90.13,14.790,14.660,-23.100,38.89,5093.0,NaN,1058.0,NaN,1975-01-17 20:58:15
67325,405.3,-58.710,-67.72,22.370,22.280,-54.870,112.00,17490.0,NaN,NaN,-1.0,1977-03-04 03:04:45
66810,279.8,3.937,-71.28,7.443,7.443,30.090,68.63,3408.0,NaN,721.2,NaN,1974-09-30 12:01:45

## AE-D

In [44]:
ae_d = load_lst_folder_with_datetime(
    folder_path="/Users/elliotdable/Documents/PhD/research/fpi_ml/data/atmospheric_explorer/ae_d", 
    column_names=["year","month", "day","hour", "minute", "second", "altitude", "latitude", "longitude",
    "local_time", "local_magnetic_time",  "magnetic_inclination", "solar_zenith_angle", 
    "orbit_number", "mesa_wind_component", "neutral_temp", "zonal_winds"],
    target_columns=["neutral_temp", "zonal_winds", "mesa_wind_component"])

In [45]:
ae_d.sample(5)

,altitude,latitude,longitude,local_time,local_magnetic_time,magnetic_inclination,solar_zenith_angle,orbit_number,mesa_wind_component,neutral_temp,zonal_winds,datetime
23338,260.8,-30.05,114.00,7.523,7.211,-64.95,59.6,980.0,NaN,803.500000,NaN,1975-12-28 23:57:00
5075,198.1,85.09,175.90,23.120,20.220,NaN,111.6,392.0,NaN,766.300000,NaN,1975-11-09 11:07:00
9444,150.7,64.66,-44.32,9.797,11.120,78.89,89.3,603.0,NaN,0.049210,101.4,1975-11-27 12:32:30
4436,169.0,50.83,-69.97,23.210,23.130,77.00,144.1,365.0,NaN,0.003397,-141.4,1975-11-07 03:36:00
3850,219.6,37.12,-76.70,23.340,23.220,68.39,156.8,342.0,NaN,698.300000,-128.1,1975-11-05 04:10:30

## AE-E

In [46]:
ae_e = load_lst_folder_with_datetime(
    folder_path="/Users/elliotdable/Documents/PhD/research/fpi_ml/data/atmospheric_explorer/ae_e", 
    column_names=["year","month", "day","hour", "minute", "second", "altitude", "latitude", "longitude",
    "local_time", "local_magnetic_time",  "magnetic_inclination", "solar_zenith_angle", 
    "orbit_number", "mesa_wind_component", "neutral_temp", "meridional_winds", "vertical_winds"],
    target_columns=["neutral_temp", "meridional_winds", "vertical_winds", "mesa_wind_component"])

ae_e['meridional_winds'] = ae_e['meridional_winds']*-1  # Correct sign convention, north needs to be positive

In [47]:
ae_e.sample(5)

,altitude,latitude,longitude,local_time,local_magnetic_time,magnetic_inclination,solar_zenith_angle,orbit_number,mesa_wind_component,neutral_temp,meridional_winds,vertical_winds,datetime
128398,220.2,5.972,173.80,23.490,23.670,4.173,165.10,5041.0,NaN,NaN,-15.450,NaN,1976-11-16 11:39:15
143784,248.9,-8.755,35.68,4.694,4.374,-40.750,105.60,6227.0,NaN,703.8,-4.686,NaN,1977-01-29 02:32:00
22182,376.8,9.798,-134.30,17.390,17.210,25.080,80.66,15770.0,NaN,1094.0,84.270,NaN,1978-09-19 02:14:15
170231,260.2,19.480,99.66,23.020,23.040,23.390,147.40,7460.0,NaN,732.0,-40.730,NaN,1977-04-15 16:22:30
113607,188.8,5.249,138.50,2.025,2.030,-5.462,148.50,4055.0,NaN,605.5,NaN,NaN,1976-09-14 16:42:45

## DE-DE2

In [48]:
de_2 = load_lst_folder_with_datetime(
    folder_path="/Users/elliotdable/Documents/PhD/research/fpi_ml/data/atmospheric_explorer/ae_de2", 
    column_names=["year","month", "day","hour", "minute", "second", "altitude", "latitude", "longitude",
    "local_time", "local_magnetic_time",  "magnetic_inclination", "solar_zenith_angle",
    "orbit_number", "mesa_wind_component", "neutral_temp", "zonal_winds", "meridional_winds", "vertical_winds", "neutral_temperature_2"],
    target_columns=["neutral_temp", "zonal_winds", "meridional_winds", "vertical_winds", "mesa_wind_component", "neutral_temperature_2"])

In [49]:
de_2.sample(5)

,altitude,latitude,longitude,local_time,local_magnetic_time,magnetic_inclination,solar_zenith_angle,orbit_number,mesa_wind_component,neutral_temp,zonal_winds,meridional_winds,vertical_winds,neutral_temperature_2,datetime
63119,369.95,-3.060,8.940,18.3000,18.28000,18.637,93.508,1750.0,1294.1,61.352,20.3450,NaN,NaN,NaN,1981-11-29 17:32:16
397513,298.00,-79.320,-16.180,2.4533,0.26000,66.543,78.184,8088.0,1275.7,-12.349,18.9860,285.89,1227.3,NaN,1983-01-19 03:42:08
32802,557.82,10.707,165.870,9.1000,8.89330,13.623,48.347,1144.0,1362.3,-59.377,NaN,NaN,NaN,NaN,1981-10-19 21:46:08
369043,491.64,-58.833,-86.533,4.8333,5.46670,47.214,78.630,7588.0,1487.1,-145.610,2.6329,NaN,NaN,NaN,1982-12-18 10:33:20
397162,277.34,-61.613,51.820,2.5000,0.59333,65.155,92.581,8085.0,1233.5,-166.250,-3.3225,NaN,NaN,NaN,1983-01-18 23:14:08

In [50]:
dfs = [ae_c, ae_d, ae_e, de_2]
dfs = [df[
        (df['latitude'] > 65) & (df['latitude'] < 75) &
        (df['altitude'] > 100) & (df['altitude'] < 300)]
    for df in dfs
]

ae_c, ae_d, ae_e, de_2 = dfs

In [51]:
de_2

,altitude,latitude,longitude,local_time,local_magnetic_time,magnetic_inclination,solar_zenith_angle,orbit_number,mesa_wind_component,neutral_temp,zonal_winds,meridional_winds,vertical_winds,neutral_temperature_2,datetime
140092,299.89,67.047,94.720,11.1,11.527,61.764,70.517,3299.0,1211.5,-15.9570,-10.894,NaN,NaN,NaN,1982-03-13 04:59:28
140093,299.26,65.973,94.660,11.1,11.513,60.736,69.458,3299.0,1184.3,-9.4145,-19.537,NaN,NaN,NaN,1982-03-13 04:59:44
140252,299.71,67.860,-48.980,11.1,12.560,75.166,71.249,3305.0,1371.6,-427.9500,33.480,NaN,NaN,NaN,1982-03-13 14:32:48
140253,299.13,66.780,-49.040,11.1,12.480,74.259,70.199,3305.0,1387.2,-246.7000,11.897,NaN,NaN,NaN,1982-03-13 14:33:04
140254,298.63,65.700,-49.100,11.1,12.400,73.323,69.151,3305.0,1351.0,-221.9100,12.395,NaN,NaN,NaN,1982-03-13 14:33:20
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
419573,251.72,71.360,-50.780,12.6,15.700,78.938,84.207,8528.0,NaN,NaN,NaN,175.64,867.88,NaN,1983-02-15 16:13:36
419574,250.21,69.213,-50.873,12.6,15.167,77.065,82.072,8528.0,1059.9,-458.1900,-42.828,NaN,NaN,NaN,1983-02-15 16:14:08
419575,249.44,68.140,-50.920,12.6,14.900,76.066,81.005,8528.0,1012.5,-527.8400,-52.548,137.95,955.63,NaN,1983-02-15 16:14:24
419576,248.66,67.067,-50.967,12.6,14.633,75.032,79.937,8528.0,1033.4,-498.2400,-12.483,NaN,NaN,NaN,1983-02-15 16:14:40
419577,247.87,65.993,-51.013,12.6,14.367,73.967,78.869,8528.0,1020.0,-475.5600,-42.290,109.21,957.50,NaN,1983-02-15 16:14:56

In [ ]:
de_2.columns, ae_e.columns, ae_d.columns, ae_c.columns

(Index(['altitude', 'latitude', 'longitude', 'local_time',
        'local_magnetic_time', 'magnetic_inclination', 'solar_zenith_angle',
        'orbit_number', 'mesa_wind_component', 'neutral_temp', 'zonal_winds',
        'meridional_winds', 'vertical_winds', 'neutral_temperature_2',
        'datetime'],
       dtype='object'),
 Index(['altitude', 'latitude', 'longitude', 'local_time',
        'local_magnetic_time', 'magnetic_inclination', 'solar_zenith_angle',
        'orbit_number', 'mesa_wind_component', 'neutral_temp',
        'meridional_winds', 'vertical_winds', 'datetime'],
       dtype='object'),
 Index(['altitude', 'latitude', 'longitude', 'local_time',
        'local_magnetic_time', 'magnetic_inclination', 'solar_zenith_angle',
        'orbit_number', 'mesa_wind_component', 'neutral_temp', 'zonal_winds',
        'datetime'],
       dtype='object'),
 Index(['altitude', 'latitude', 'longitude', 'local_time',
        'local_magnetic_time', 'magnetic_inclination', 'solar_zenith_angle',
        'orbit_number', 'mesa_wind_component', 'neutral_temp', 'vertical_winds',
        'datetime'],
       dtype='object'))

In [53]:
de_2 = de_2[["datetime", "altitude", "latitude", "longitude", "neutral_temp", 'zonal_winds', 'meridional_winds', 'vertical_winds']]

ae_e = ae_e[["datetime", "altitude", "latitude", "longitude", "neutral_temp", 'meridional_winds', 'vertical_winds']]

ae_d = ae_d[["datetime", "altitude", "latitude", "longitude", "neutral_temp", 'zonal_winds']]

ae_c = ae_c[["datetime", "altitude", "latitude", "longitude", "neutral_temp", 'vertical_winds']]

In [54]:
ae_c

,datetime,altitude,latitude,longitude,neutral_temp,vertical_winds
8430,1974-02-16 11:27:15,296.9,65.67,-38.960,NaN,2.696000e-33
8431,1974-02-16 11:27:30,286.2,65.18,-36.690,NaN,9.630000e-34
8496,1974-02-17 15:23:15,295.9,65.93,-102.300,870.5,-3.574000e+02
8497,1974-02-17 15:23:30,285.2,65.46,-99.930,878.3,-3.386000e+02
8555,1974-03-10 03:26:15,220.7,67.86,9.151,1008.0,NaN
...,...,...,...,...,...,...
86640,1975-03-30 20:43:30,234.9,66.91,-114.300,939.5,NaN
86641,1975-03-30 20:43:45,234.8,66.58,-112.000,947.0,NaN
86642,1975-03-30 20:44:00,234.8,66.21,-109.700,946.8,NaN
86643,1975-03-30 20:44:15,234.7,65.80,-107.500,921.5,NaN
86644,1975-03-30 20:44:30,234.6,65.37,-105.400,897.5,NaN

In [55]:
combined_df = pd.concat(
    [de_2, ae_e, ae_d, ae_c],
    ignore_index=True,
    sort=False
)

In [56]:
combined_df

,datetime,altitude,latitude,longitude,neutral_temp,zonal_winds,meridional_winds,vertical_winds
0,1982-03-13 04:59:28,299.89,67.047,94.72,-15.9570,-10.894,NaN,NaN
1,1982-03-13 04:59:44,299.26,65.973,94.66,-9.4145,-19.537,NaN,NaN
2,1982-03-13 14:32:48,299.71,67.860,-48.98,-427.9500,33.480,NaN,NaN
3,1982-03-13 14:33:04,299.13,66.780,-49.04,-246.7000,11.897,NaN,NaN
4,1982-03-13 14:33:20,298.63,65.700,-49.10,-221.9100,12.395,NaN,NaN
...,...,...,...,...,...,...,...,...
9211,1975-03-30 20:43:30,234.90,66.910,-114.30,939.5000,NaN,NaN,NaN
9212,1975-03-30 20:43:45,234.80,66.580,-112.00,947.0000,NaN,NaN,NaN
9213,1975-03-30 20:44:00,234.80,66.210,-109.70,946.8000,NaN,NaN,NaN
9214,1975-03-30 20:44:15,234.70,65.800,-107.50,921.5000,NaN,NaN,NaN
9215,1975-03-30 20:44:30,234.60,65.370,-105.40,897.5000,NaN,NaN,NaN

In [60]:
combined_df[(combined_df['longitude'] > 5) & (combined_df['longitude'] < 30)]

,datetime,altitude,latitude,longitude,neutral_temp,zonal_winds,meridional_winds,vertical_winds
10,1982-03-14 09:39:12,299.72,70.320,23.660,-84.209,-21.178,NaN,NaN
11,1982-03-14 09:39:28,299.20,69.247,23.607,-76.707,-23.483,NaN,NaN
12,1982-03-14 09:39:44,298.76,68.173,23.553,-64.860,-19.488,NaN,NaN
13,1982-03-14 09:40:00,298.40,67.100,23.500,-61.536,-22.976,NaN,NaN
14,1982-03-14 09:40:16,298.13,66.020,23.433,-61.335,-24.540,NaN,NaN
...,...,...,...,...,...,...,...,...
8760,1975-02-20 00:02:15,246.30,65.180,12.460,854.500,NaN,NaN,NaN
8858,1975-02-27 20:27:15,259.30,68.100,5.630,652.800,NaN,NaN,NaN
8859,1975-02-27 20:27:45,259.30,67.920,10.830,506.800,NaN,NaN,NaN
8860,1975-02-27 20:29:45,258.70,65.610,29.870,741.300,NaN,NaN,NaN
9100,1975-03-30 13:20:00,235.10,65.450,6.663,876.300,NaN,NaN,NaN